---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.AverageEstimatedIllumination
source: html/2acff5e7-909b-25a3-7086-d5e7f3a67b18.htm
---
# Autodesk.Revit.DB.Mechanical.Space.AverageEstimatedIllumination Property

Get the Average Estimated Illumination of the Space.

## Syntax (C#)
```csharp
public double AverageEstimatedIllumination { get; }
```

## Remarks
This property is used to get the Average Estimated Illumination of the Space. (Unit: fc)